Revit 2027 API
MultiReferenceAnnotationType.IsAllowedDimensionStyle Method
 Checks if the dimension style can be used with multi-reference annotations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAllowedDimensionStyle(
	ElementId dimensionStyleId
)
Public Function IsAllowedDimensionStyle (
	dimensionStyleId As ElementId
) As Boolean
public:
bool IsAllowedDimensionStyle(
	ElementId^ dimensionStyleId
)
member IsAllowedDimensionStyle :
        dimensionStyleId : ElementId -> bool
Parameters
dimensionStyleId ElementId
 The dimension style to check.
Return Value
Boolean
 True if the dimension style can be used by multi-reference annotations.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only linear dimension styles are allowed.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace